In [175]:
"""
Colby Bailey
data science summer 2023
UTSA Student ID: nib667
"""

'\nColby Bailey\ndata science summer 2023\nUTSA Student ID: nib667\n'

In [176]:
# All imports
import zipfile
import os
import pandas as pd
import matplotlib.pyplot as pp

In [177]:
# TASK 1

In [178]:
# Extract file and list what was inside
zipfile.ZipFile( 'names.zip' ).extractall( '.' )
os.listdir( 'names' )

['yob2000.txt',
 'yob2014.txt',
 'yob1938.txt',
 'yob1910.txt',
 'yob1904.txt',
 'yob1905.txt',
 'yob1911.txt',
 'yob1939.txt',
 'yob2001.txt',
 'yob2003.txt',
 'yob1907.txt',
 'yob1913.txt',
 'yob1898.txt',
 'yob1899.txt',
 'yob1912.txt',
 'yob1906.txt',
 'yob2002.txt',
 'yob2012.txt',
 'yob2006.txt',
 'yob1902.txt',
 'yob1916.txt',
 'yob1889.txt',
 'yob1888.txt',
 'yob1917.txt',
 'yob1903.txt',
 'yob2007.txt',
 'yob2013.txt',
 'yob2005.txt',
 'yob2011.txt',
 'yob1915.txt',
 'yob1901.txt',
 'yob1929.txt',
 'yob1928.txt',
 'yob1900.txt',
 'yob1914.txt',
 'yob2010.txt',
 'yob2004.txt',
 'yob1973.txt',
 'yob1967.txt',
 'yob1998.txt',
 'yob1999.txt',
 'yob1966.txt',
 'yob1972.txt',
 'yob1958.txt',
 'yob1964.txt',
 'yob1970.txt',
 'yob1971.txt',
 'yob1965.txt',
 'yob1959.txt',
 'yob1961.txt',
 'yob1975.txt',
 'yob1949.txt',
 'yob1948.txt',
 'yob1974.txt',
 'yob1960.txt',
 'yob1976.txt',
 'yob1962.txt',
 'yob1989.txt',
 'yob1988.txt',
 'yob1963.txt',
 'yob1977.txt',
 'yob1952.txt',
 'yob1946.txt',
 'yob1991.txt',
 'yob1985.txt',
 'yob1984.txt',
 'yob1990.txt',
 'yob1947.txt',
 'yob1953.txt',
 'yob1979.txt',
 'yob1945.txt',
 'yob1951.txt',
 'yob1986.txt',
 'yob1992.txt',
 'yob1993.txt',
 'yob1987.txt',
 'yob1950.txt',
 'yob1944.txt',
 'yob1978.txt',
 'yob1940.txt',
 'yob1954.txt',
 'yob1968.txt',
 'yob1983.txt',
 'yob1997.txt',
 'yob1996.txt',
 'yob1982.txt',
 'yob1969.txt',
 'yob1955.txt',
 'yob1941.txt',
 'yob1957.txt',
 'yob1943.txt',
 'yob1994.txt',
 'yob1980.txt',
 'yob1981.txt',
 'yob1995.txt',
 'yob1942.txt',
 'yob1956.txt',
 'yob2009.txt',
 'yob1919.txt',
 'yob1931.txt',
 'yob1925.txt',
 'yob1886.txt',
 'yob1892.txt',
 'yob1893.txt',
 'yob1887.txt',
 'yob1924.txt',
 'yob1930.txt',
 'yob1918.txt',
 'yob2008.txt',
 'yob1926.txt',
 'yob1932.txt',
 'yob1891.txt',
 'yob1885.txt',
 'NationalReadMe.pdf',
 'yob1884.txt',
 'yob1890.txt',
 'yob1933.txt',
 'yob1927.txt',
 'yob1923.txt',
 'yob1937.txt',
 'yob1894.txt',
 'yob1880.txt',
 'yob1881.txt',
 'yob1895.txt',
 'yob1936.txt',
 'yob1922.txt',
 'yob1934.txt',
 'yob1920.txt',
 'yob1908.txt',
 'yob1883.txt',
 'yob1897.txt',
 'yob1896.txt',
 'yob1882.txt',
 'yob1909.txt',
 'yob1921.txt',
 'yob1935.txt']

In [179]:
"""
Loop through years. Read file name with formatted string literal. Read names
from file name into respective year and categories. Apply year to current, and
then append to allyears dataframe.
"""
allyears = []
for year in range( 1880, 2015 ):
    file = 'yob' + f'{ year }' + ".txt" 
    current = pd.read_csv( ( 'names/' + f'{file}' ), names=[ 'name', 'sex', 'number' ] )
    current[ 'year' ] = year
    allyears.append( current )

In [180]:
# Concatinate all DataFrames into a single one and store in allyears
allyears = pd.concat( allyears )

In [181]:
# Output head of allyears DataFrame
allyears.head( )

        name sex  number  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

In [182]:
# Output tail of allyears DataFrame
allyears.tail( )

          name sex  number  year
33039   Zykeem   M       5  2014
33040   Zymeer   M       5  2014
33041  Zymiere   M       5  2014
33042    Zyran   M       5  2014
33043    Zyrin   M       5  2014

In [183]:
# TASK 2

In [184]:
"""
Sort the years by sex and name and them group them by calculating the sum
of the # column. Then use the unstack() method on the result by the
'sex' column to get # times each name was used per sex
"""

allyears_indexed = allyears.set_index( [ 'sex', 'name' ] ).sort_index( )
totals_bysex = allyears.groupby( [ 'sex', 'name' ] )[ 'number' ].sum( )
totals_bysex = totals_bysex.unstack( 'sex' )

In [185]:
# Output the first five rows of the resulting DataFrame
print(totals_bysex.head( 5 ) )

sex           F      M
name
Aaban       NaN   72.0
Aabha      21.0    NaN
Aabid       NaN    5.0
Aabriella  10.0    NaN
Aadam       NaN  196.0